Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: The following example uses the zip(_:_:) function to iterate over an array of strings and a countable range at the same time:
ja: 以下の例はzip(_:_:)関数を使って、同時に文字列からなる配列とある可付番範囲の全体にわたって反復します：

source: The following example uses this initializer to create a new Double instance with the sign of a and the magnitude of b:
ja: 以下の例は、このイニシャライザを使って新しいDoubleインスタンスをaの符号とbの規模で作成します：

source: The following example uses this initializer to create a new Double instance.
ja: 以下の例は、このイニシャライザを使って新しいDoubleインスタンスを作成します。

source: The following example uses this method to convert a partial range up to 4 into a half-open range, using an array instance to add the range’s lower bound.
ja: 以下の例は、このメソッドを使って、4までの不完全な範囲を半開範囲へと変換します、配列インスタンスを使って範囲の下側の境界を追加しています。

source: The following example uses this method to multiply two Int8 values that normally overflow when multiplied:
ja: 以下の例は、このメソッドを使って、通常は乗算した時オーバーフローする２つのInt8値を乗算します：

source: The following example uses this method to multiply two UInt8 values that normally overflow when multiplied:
ja: 以下の例は、このメソッドを使って、通常は乗算した時オーバーフローする２つのUInt8値を乗算します：

source: The following example uses this subscript while counting the occurrences of each letter in a string:
ja: 以下の例は、この添え字を、ある文字列の中の各印字の出現を数える間に使います：

source: The following examples show the effects of the maxSplits and omittingEmptySubsequences parameters when splitting a string at each space character (” “).
ja: 以下の例は、maxSplitsとomittingEmptySubsequencesパラメータの効果を、各空白文字（” “）で文字列を分割する場合で示します。

source: The following examples show the effects of the maxSplits and omittingEmptySubsequences parameters when splitting a string using a closure that matches spaces.
ja: 以下の例は、maxSplitsとomittingEmptySubsequencesパラメータの効果を、空白にマッチするクロージャを使って文字列を分割する場合で示します。

source: The following special cases also apply:
ja: 以下の特別な場合もまた適用されます：

source: The following tables use Type as a placeholder type name to indicate syntax for the mappings.
ja: 以下の表は、Typeをプレースホルダー型名として使ってマップのための構文を示します。

source: The function uses type(of:) to find the dynamic type of value, which itself is an instance of the Smiley.Type metatype.
ja: この関数は、type(of:)を使ってvalueの動的型を見つけます、それはそれ自身がSmiley.Typeメタタイプのインスタンスです。

source: The function uses the multipliedReportingOverflow(by:) method to multiply x by itself and check whether the result is too large to represent in the same type.
ja: この関数は、multipliedReportingOverflow(by:)メソッドを使って、xをそれ自身で乗算して、結果が同じ型で表現するのに大きすぎないかどうか検査します。

source: The function won’t compile as written, because a lazy collection’s filter(_:) method requires an escaping closure.
ja: この関数は書いた通りにコンパイルしないでしょう、なぜなら遅延コレクションのもつfilter(_:)メソッドが脱出クロージャを要求するからです。

source: The given argument without any changes.
ja: 何ら変更のない、与えられた引数。

source: The given string may begin with a plus or minus sign character (+ or -).
ja: 与えられた文字列は、プラスまたはマイナス符号文字（+または-）で始まっても構いません。

source: The global abs(_:) function provides more familiar syntax when you need to find an absolute value.
ja: グローバルabs(_:)関数は、あなたが絶対値を見つける必要がある時により親しみやすい構文を提供します。

source: The greater of x and y, or whichever is a number if the other is NaN.
ja: xとyのより大きい方、または他方がNaNならば数である方。

source: The greater of x and y.
ja: xとyのうちより大きいもの。

source: The greatest finite number representable by this type.
ja: この型によって表現可能な最も大きな有限数。

source: The greatest of all the arguments.
ja: すべての引数のうち最も大きいもの。

source: The greatest representable value that compares less than this value.
ja: 表現可能な最も大きい値で、この値と比較してより小さいもの。

source: The hash algorithm implemented by Hasher may itself change between any two versions of the standard library.
ja: Hasherによって実装されるハッシュアルゴリズムは、標準ライブラリの任意の２つのバージョン間でそれ自体が変化するかもしれません。

source: The hash value calculated by the hasher.
ja: ハーシャーによって計算されるハッシュ値。

source: The hash value.
ja: ハッシュ値。

source: The hasher to use when combining the components of this instance.
ja: このインスタンスの構成要素を結合する場合に使うハーシャー。

source: The hasher uses a per-execution seed value that is set during process startup, usually from a high-quality random source.
ja: ハーシャーは実行毎シード値を使います、それはプロセスの立ち上げの間に設定されます、ふつうは高品質の無作為出典から。

source: The header's name is generated from your product module name, followed by "-Swift.h".
ja: ヘッダの名前は、あなたの製品モジュール名から、それに"-Swift.h"を続けることで生成されます。

source: The identical-to operator (===) returns false when comparing two references to different object instances, even if the two instances have the same value.
ja: 同一性演算子（===）は、２つのインスタンスを比較して異なるオブジェクトインスタンスであるときfalseを返します、２つのインスタンスが同じ値を持つとしてもです。

source: The identity of a class instance is not part of an instance’s value.
ja: クラスインスタンスの同一性は、インスタンスの持つ値の部分のことではありません。

source: The implementation of the == function returns the same value whether its two arguments are the same instance or are two different instances with the same integer stored in their value properties.
ja: ==関数の実装は、それの２つの引数が同じインスタンスであろうと、それらのvalueプロハティの中に格納される同じ整数を持つ２つの異なるインスタンスであろうと、同じ値を返します。

source: The imported Cake structure and its nested types are imported with a memberwise initializer that you can use to initialize the structure with custom values for its fields:
ja: インポートされたCake構造体とそれの入れ子にされる型は、あるメンバー関連イニシャライザを使ってインポートされます、それをあなたは使うことで構造体をそれのフィールドにカスタム値を使って初期化できます：

source: The imported Swift structure contains a stored property for each C structure field and an initializer whose parameters correspond to the stored properties.
ja: インポートされたSwift構造体は、各C構造体フィールドに対してひとつの格納プロパティを、そしてそれのパラメータが格納プロパティと対応するひとつのイニシャライザを含みます。

source: The index at which to start the resulting subsequence.
ja: それで結果の下位シーケンスが始まるインデックス。

source: The index for key and its associated value if key is in the dictionary; otherwise, nil.
ja: keyとそれの結び付けられた値のインデックス、keyが辞書の中にあるならば；そうでなければ、nil。

source: The index immediately after i.
ja: iの直後のインデックス。

source: The index immediately before i.
ja: iの直前のインデックス。

source: The index of the element to access.
ja: アクセスする要素のインデックス。

source: The index of the first element for which predicate returns true.
ja: それに対してpredicateがtrueを返す最初の要素のインデックス。

source: The index of the first element in the reordered collection that matches belongsInSecondPartition.
ja: 並べ直されたコレクションの中の最初の要素のインデックス、それはbelongsInSecondPartitionに合致します。

source: The index of the first value to swap.
ja: 交換する１つ目の値のインデックス。

source: The index of the last element in the collection that matches predicate, or nil if no elements match.
ja: predicateに合致する、コレクションの中の最後の要素のインデックス、または合致する要素がないならばnil。

source: The index of the last element to include in the resulting subsequence.
ja: 結果の下位シーケンスの中に含まれることになる最後の要素のインデックス。

source: The index of the second value to swap.
ja: 交換する２つ目の値のインデックス。

source: The index type for arrays, Int.
ja: 配列のためのインデックス型、Int。

source: The index value immediately after i.
ja: iの直後のインデックス。

source: The index value immediately before i.
ja: iの直前のインデックス値。

source: The indices that are valid for subscripting the collection, in ascending order.
ja: コレクションの添え字に使うのに有効である、昇順でのインデックス。

source: The initial state that will be passed to the closure.
ja: 初期状態、それはクロージャに渡されます。

source: The input string to convert to a Double instance.
ja: Doubleインスタンスへ変換することになる入力文字列。

source: The input string to convert to a Float16 instance.
ja: Float16インスタンスへ変換することになる入力文字列。

source: The input string to convert to a Float80 instance.
ja: Float80インスタンスへ変換することになる入力文字列。

source: The input string to convert to a Float instance.
ja: Floatインスタンスへ変換することになる入力文字列。

source: The insertions contained by this difference, from lowest offset to highest.
ja: この差異によって含まれる挿入、最も低いオフセットから最も高い方へと。

source: The instance x, cast to type T.
ja: インスタンスx、型Tにキャスト済み。

source: The instance passed as value.
ja: valueとして渡されるインスタンス。

source: The instance passed as x must be an instance of type T.
ja: xとして渡されるインスタンスは、型Tのインスタンスでなければなりません。

source: The instance to cast to type.
ja: typeにキャストすることになるインスタンス。

source: The instances of NSDictionary and Dictionary share buffer using the same copy-on-write optimization that is used when two instances of Dictionary share buffer.
ja: NSDictionaryとDictionaryインスタンスは、Dictionaryの２つのインスタンスがバッファを共有するとき使われるのと、同じコピーオンライト最適化を使ってバッファを共有します。

source: The integer encoding of a Double instance.
ja: あるDoubleインスタンスの整数符号化。

source: The integer encoding of a Float16 instance.
ja: あるFloat16インスタンスの整数符号化。

source: The integer encoding of a Float instance.
ja: あるFloatインスタンスの整数符号化。

source: The integer to convert to a floating-point value.
ja: 浮動小数点値へ変換されることになる整数。

source: The integer to convert, an instance of type T.
ja: 変換する整数、型Tのあるインスタンス。

source: The integer value of the desired key.
ja: 望むキーの整数値。

source: The integer value of the unique identifier wrapped in a data value.
ja: データ値の中にラップされる特有識別子の整数値。

source: The integer wrapped in a data value.
ja: あるデータ値の中にラップされる整数。

source: The integral value found by rounding using rule.
ja: ruleを使って丸められることによって見出される整数値。

source: The iterator can choose how to handle and respond to cancellation, including:
ja: イテレータは、どのように取り消しを処理してそして応答するかを選択できます、それは次を含みます：

source: The iterator for EnumeratedSequence.
ja: EnumeratedSequenceのためのイテレータ。

source: The iterator returns nil to indicate the end of the sequence.
ja: イテレータ（反復子）は、nilを返すことでシーケンスの終わりを指し示します。

source: The iterator that produces elements of the compact map sequence.
ja: コンパクトマップシーケンスの要素それらを生み出すイテレータ。

source: The iterator that produces elements of the drop-first sequence.
ja: drop-firstシーケンスの要素それらを生み出すイテレータ。

source: The iterator that produces elements of the drop-while sequence.
ja: drop-whileシーケンスの要素それらを生み出すイテレータ。

source: The iterator that produces elements of the filter sequence.
ja: フィルタシーケンスの要素それらを生み出すイテレータ。

source: The iterator that produces elements of the flat map sequence.
ja: フラットマップシーケンスの要素それらを生み出すイテレータ。

source: The iterator that produces elements of the map sequence.
ja: マップシーケンスの要素それらを生み出すイテレータ。

source: The iterator that produces elements of the prefix sequence.
ja: prefixシーケンスの要素それらを生み出すイテレータ。

source: The iterator that produces elements of the prefix-while sequence.
ja: prefix-whileシーケンスの要素それらを生み出すイテレータ。

source: The joined sequence of elements.
ja: つなぎ合わされたシーケンス要素。

source: The key path to append.
ja: 追加することになるキーパス。

source: The key the look up in the dictionary.
ja: 辞書の中を検索するキー。

source: The key to associate with value.
ja: valueと結び付けられるキー。

source: The key to compare against.
ja: このキーに対して比較します。

source: The key to compare with.
ja: このキーと比較します。

source: The key to find in the dictionary.
ja: このキーが辞書において捜されます。

source: The key to remove along with its associated value.
ja: それの関連する値とともに削除されるキー。

source: The key type of a dictionary literal.
ja: 辞書リテラルのキー型。

source: The key type to use for the container.
ja: コンテナに対して使うためのキー型。

source: The key-value pair that correspond to index.
ja: indexに対応するキー値ペア。

source: The key-value pairs that will make up the new dictionary.
ja: 新しい辞書を作り上げるキー値ペア。

source: The key’s hash value.
ja: そのキーのもつハッシュ値。

source: The key’s string value.
ja: キーのもつ文字列値。

source: The lanewise maximum of two vectors.
ja: ２つのベクターのレーン単位の最大。

source: The lanewise minimum of two vectors.
ja: ２つのベクターのレーン単位最小。

source: The last element of the collection if the collection has one or more elements; otherwise, nil.
ja: コレクションが１つ以上の要素を持つならばコレクションの最後の要素；そうでなければnil。

source: The last element of the collection if the collection is not empty; otherwise, nil.
ja: コレクションが空でないならばコレクションの最後の要素；そうでなければnil。

source: The last element of the collection.
ja: コレクションの最後の要素。

source: The last element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最後の要素、またはpredicateを満たす要素が無いならばnil。

source: The last index where element is found.
ja: そこでelementが見つけられた最後のインデックス。

source: The lazy collection isn’t persisted, so the predicate closure won’t actually escape the body of the function; nevertheless, it can’t be used in this way.
ja: 遅延コレクションは持続させられません、それでpredicateクロージャは実際には関数の本文を脱出することはありません；それはこの方法では使用できません。

source: The least normal exponent for values of the type F is 1 - bias, and the largest finite exponent is bias.
ja: 型Fの最小正規化指数は、1 - biasです、最大有限指数はbiasです。

source: The least of all the arguments.
ja: すべての引数のうち最も少ないもの。

source: The least positive normal number.
ja: 最も小さい正のノーマル数。

source: The least positive number.
ja: 最も小さい正の数。

source: The least representable value that compares greater than this value.
ja: 表現可能な最も小さい値で、この値と比較してより大きいもの。

source: The left-hand side of the operation.
ja: 演算子の左手側。

source: The lesser of x and y.
ja: xとyのうちより小さいもの。

source: The line number to print along with message if the assertion fails.
ja: 表明（アサーション）がうまくいかないならば、messageとともに出力する行番号。

source: The line number to print along with message.
ja: messageに加えて出力される行番号。

source: The little-endian representation of this integer.
ja: この整数のリトルエンディアン表現。

source: The logical AND operator (&&) combines two Boolean values and returns true if both of the values are true.
ja: 論理AND演算子（&&）は２つのブール値を組み合わせて、trueを両方の値がtrueならば返します。

source: The logical NOT operator (!) inverts a Boolean value.
ja: 論理NOT演算子（!）は、ブール値を逆にします。

source: The logical OR operator (||) combines two Boolean values and returns true if at least one of the values is true.
ja: 論理OR演算子（||）は、２つのブール値を組み合わせて、trueを値の少なくとも１つがtrueならば返します。

source: The lower bound for the range.
ja: 範囲の下側の境界。

source: The magnitude of a floating-point value x of type F can be calculated by using the following formula, where ** is exponentiation:
ja: 型Fの浮動小数点値xの規模は、以下の公式を使って計算されることができます、そこで**は冪演算です：

source: The magnitude of this value.
ja: この値の規模。

source: The map sequence produces whatever type of element its the transforming closure produces.
ja: マップシーケンスは、それの変換クロージャが生み出す要素の型が何であろうとも生み出します。

source: The map sequence produces whatever type of element its transforming closure produces.
ja: マップシーケンスは、それの変換クロージャが生み出す要素の型が何であろうとも生み出します。

source: The masking addition assignment operator (&+=) silently wraps any overflow that occurs during the operation.
ja: マスク加算代入演算子（&+=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The masking multiplication assignment operator (&*=) silently wraps any overflow that occurs during the operation.
ja: マスク乗算代入演算子（&*=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The masking subtraction assignment operator (&-=) silently wraps any overflow that occurs during the operation.
ja: マスク減算代入演算子（&-=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The mathematical constant pi.
ja: 数学の定数pi。

source: The maximum depth to descend when writing the contents of a value that has nested components.
ja: 入れ子になった構成要素を持つ値の内容を書き出す時に下る最大の深さ。

source: The maximum number of elements for which to write the full contents.
ja: 完全な内容を書き出すための最大要素数。

source: The maximum number of elements to hold in the buffer past any checks for continuations being resumed.
ja: 継続が再開されるためのあらゆる検査を通過した後にバッファの中に保持する要素の最大数。

source: The maximum number of elements to return.
ja: 返される要素の最大限の数。

source: The maximum number of pending elements limited by dropping the oldest value when a new value comes in if the buffer would excede the limit placed upon it.
ja: 新しい値がやって来る時にもしバッファがそれの上に置かれる制限を越えるならば最古の値を除くことによって限界を設けられる未解決要素の最大数。

source: The maximum number of times to split the collection, or one less than the number of subsequences to return.
ja: コレクションを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum number of times to split the sequence, or one less than the number of subsequences to return.
ja: シーケンスを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum representable integer in this type.
ja: この型における最大の表現可能な整数。

source: The memory in the range buffer[0..Count] must be initialized at the end of the closure’s execution, and the memory in the range buffer[initializedCount...] must be uninitialized.
ja: 範囲buffer[0..Count]の中のメモリは、クロージャの遂行の終わりで初期化されなければなりません、そして範囲buffer[initializedCount...]の中のメモリは、未初期化でなければなりません。

source: The method has a void return type.
ja: そのメソッドはvoid戻り型を持つ。

source: The method that takes a completion handler must meet the following requirements:
ja: 完了ハンドラをとるメソッドは、以下の要件を満たさなければなりません：

source: The minimum number of key-value pairs that the newly created dictionary should be able to store without reallocating its storage buffer.
ja: 新しく作成された辞書がそれのストレージバッファをアロケートし直すことなしに格納できるであろうキー値ペアの最小の数。

source: The minimum of x and y, or whichever is a number if the other is NaN.
ja: xとyの最小、または他方がNaNならば数である方。

source: The minimum representable integer in this type.
ja: この型における最小の表現可能な整数。

source: The modified sequence ends when the predicate closure returns false or throws an error.
ja: 修正されたシーケンスは、述部クロージャがfalseを返すかエラーをスローする時に終わります。

source: The modified sequence ends when the predicate closure returns false.
ja: 修正されたシーケンスは、条件クロージャがfalseを返す時に終わります。

source: The most common way to access values in a dictionary is to use a key as a subscript.
ja: 辞書の中の値にアクセスする最も普通の方法は、キーを添え字として使うことです。

source: The most familiar use of relational operators is to compare numbers, as in the following example:
ja: 最もよく知られている関係演算子の使用は、数の比較に対してです、以下の例でのように：

source: The multiplication operator (*) calculates the product of its two arguments.
ja: 乗算演算子（*）は、それの２つの引数の積を計算します。

source: The name of the Swift method is modified from the Objective-C method as follows:
ja: Swiftメソッドの名前は、Objective-Cメソッドから以下のように修正されます：

source: The name “epsilon” suggests that this quantity is a good tolerance to choose for approximate comparisons, but it is almost always unsuitable for that purpose.
ja: 名前 “イプシロン” は、この量がおおよその比較のために選ぶのに良い許容誤差であることを暗示します、しかしそれはほとんど常にその目的のために適しません。

source: The naming of those macros is slightly misleading, because infinity is greater than this value.
ja: これらのマクロの命名の仕方は少しばかり誤解させます、なぜならinfinityはこの値より大きいからです。

source: The naming of those macros is slightly misleading, because subnormals, zeros, and negative numbers are smaller than this value.
ja: これらのマクロの命名の仕方は少しばかり誤解させます、なぜならサブノーマル、ゼロ、そして負の数はこの値より小さいからです。

source: The nearest integral value, or, if two integral values are equally close, the integral value with greater magnitude.
ja: 最も近い整数値、または、２つの整数値が同じくらい近いならば、より大きい規模を持つ整数値。

source: The negation operator (prefix -) returns the additive inverse of its argument.
ja: 負にする演算子（前置-）は、この引数の加法の逆元を返します。

source: The new studentsByLetter dictionary has three entries, with students’ names grouped by the keys "E", "K", and "A".
ja: 新しいstudentsByLetter辞書は、生徒の名前をキー"E"、"K"、そして"A"でグループ分けして、３つの登録項目を持ちます。

source: The new array, on the other hand, matches the order and number of elements provided.
ja: 一方、新しい配列は、提供された要素の順番と数に合致します。

source: The new element is inserted before the element currently at the specified index.
ja: 新しい要素は、指定されたインデックスでの現在の要素の前に挿入されます。

source: The new element to insert into the array.
ja: 配列に挿入されることになる新しい要素。

source: The new elements are inserted before the element currently at the specified index.
ja: 新しいいくらかの要素が、指定されたインデックスでの現在の要素の前に挿入されます。

source: The new elements to add to the array.
ja: 配列に加えられることになる新しい要素ら。

source: The new elements to add to the collection.
ja: コレクションに加える新しいいくらかの要素。

source: The new elements to insert into the collection.
ja: コレクションへ挿入される新しいいくらかの要素。

source: The new storage is a multiple of the old storage’s size.
ja: 新しいストレージは古いストレージの大きさの倍数です。

source: The new value represents the address of the pointer passed as pointer.
ja: 新しい値は、pointerとして渡されるポインタのアドレスを表します。

source: The new value to add to the dictionary.
ja: この辞書に加える新しい値。

source: The new value’s exponent.
ja: 新しい値の持つ指数。

source: The new value’s significand.
ja: 新しい値の持つ仮数。

source: The next code sample shows a possible extension to the Int type that parses the integer value of a String instance, throwing an error when there is a problem during parsing.
ja: 次のコード例が示すのは、Int型に対する１つの可能な拡張で、それはStringインスタンスの整数値をパースして、パースの間に問題がある時はエラーをスローします。

source: The next element in the underlying sequence if a next element exists; otherwise, nil.
ja: 次の要素が存在するならば基礎をなすシーケンス中の次の要素；そうでなければ、nil。

source: The next element in the underlying sequence, if a next element exists; otherwise, nil.
ja: 次の要素が存在するならば、基礎をなすシーケンス中の次の要素；そうでなければ、nil。

source: The next element, if it exists, or nil to signal the end of the sequence.
ja: 次の要素、もしそれが存在するならば、またはシーケンスの終わりを合図するnil。

source: The next example attempts to retrieve an index six positions from s.startIndex but fails, because that distance is beyond the index passed as limit.
ja: 次の例はs.startIndexから６位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The next example attempts to retrieve an index ten positions from numbers.startIndex, but fails, because that distance is beyond the index passed as limit.
ja: 次の例はnumbers.startIndexから10位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The next example creates a slice of numbers starting at index 2, and then uses the slice with relative(to:) to convert upToFour to a concrete range.
ja: 次の例は、numbersのスライスをインデックス2で開始して作成して、それからそのスライスをrelative(to:)と使うことでupToFourを具体的な範囲へ変換します。

source: The next example declares a generic squared function, which accepts an instance x of any fixed-width integer type.
ja: 次の例は、総称体squared関数を宣言します、それはどんな固定長整数型のxインスタンスでも受け取ります。

source: The next example tries to find the correct text for a greeting in two separate dictionaries before falling back to a static default.
ja: 次の例は、挨拶として正しいテキストを２つの独立した辞書から見つけることをある静的な省略時のものに落ち着く前に試みます。

source: The next example uses key-based subscripting of the responseMessages dictionary with two keys that exist in the dictionary and one that does not.
ja: 次の例は、キーに基づく添え字をresponseMessages辞書に使います、ですが２つのキーは辞書に存在し１つはそうでありません。

source: The next value from the AsyncStream.
ja: AsyncStreamからの次の値。

source: The number of bits equal to 1 in this value’s binary representation.
ja: この値のバイナリ表現の中の１に等しいビットの数。

source: The number of bits in the binary representation of this value.
ja: この値のバイナリ表現でのビット数。

source: The number of bits in the current binary representation of this value.
ja: この値の現在のバイナリ表現でのビット数。

source: The number of bits required to represent the value’s significand.
ja: 値の仮数を表すのに必要とされるビットの数。

source: The number of bits to shift lhs to the left.
ja: このビット数をlhsから左へとシフトします。

source: The number of bits to shift lhs to the right.
ja: このビット数をlhsから右へとシフトします。

source: The number of bits used for the underlying binary representation of values of this type.
ja: この型の値の基礎をなすバイナリ表現に対して使われるビットの数。

source: The number of bits used to represent the type’s exponent.
ja: 型のもつ指数を表すのに使われるビットの数。

source: The number of elements (always zero).
ja: 要素の数を返します（常にゼロ）。

source: The number of elements in the array.
ja: その配列中の要素の数。

source: The number of elements in the collection, which is always one.
ja: コレクションの中の要素数、それは常に１つです。

source: The number of elements in the collection.
ja: コレクションの中の要素の数。

source: The number of elements to allocate space for in the new array.
ja: 新しい配列において空間を割り当てる要素の数。

source: The number of elements to drop from the beginning of the collection.
ja: コレクションの始まりから省く要素の数。

source: The number of elements to drop from the beginning of the sequence.
ja: このシーケンスの初めの部分から落とす要素の数。

source: The number of elements to drop off the end of the collection.
ja: コレクションの終わりで省く要素の数。

source: The number of elements to drop off the end of the sequence.
ja: シーケンスの末尾から取り除く要素の数。

source: The number of elements to remove from the collection.
ja: コレクションから削除される要素の数。

source: The number of elements to remove.
ja: 削除する要素の数を返します。

source: The number of elements.
ja: 要素の数。

source: The number of key-value pairs in the dictionary.
ja: 辞書の中のキー値ペアの数。

source: The number of keys in the dictionary.
ja: 辞書の中のキーの数。

source: The number of leading zeros in this value’s binary representation.
ja: この値のバイナリ表現における先頭のゼロの数。

source: The number of new elements need not match the number of elements being removed.
ja: 新しい要素の数は、削除される要素の数と一致する必要はありません。

source: The number of scalars, or elements, in a vector of this type.
ja: この型のあるベクターの中のスカラーそれら、または要素それらの数。

source: The number of scalars, or elements, in the vector.
ja: ベクターの中のスカラー、または要素、の数。

source: The number of spaces to use as an indent for each line of the output.
ja: 出力の各行のひとつの字下げとして使われる空白の数。
